Repository: msdx/gradle-translation
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: Gradle will expect and call a function with the signature void gradle_cunit_register() that you can use to configure the actual CUnit suites and tests to execute.
zh_cn: Gradle 将认定和调用一个void gradle_cunit_register() 函数，这个函数你可以用于配置实际的CUnit套件以及要执行的测试。

source: Gradle will figure out the properties of the artifact based on the name of the file.
zh_cn: Gradle将基于文件的名字找出构件的属性。

source: Gradle will look at the first URL for the POM and the JAR.
zh_cn: Gradle 将会在第一个URL中查找 POM 和 JAR 文件。

source: Gradle will look for the source files to include in the WAR file in src/main/webapp.
zh_cn: Gradle会在 src/main/webapp中查找源文件，并将它们包含进WAR文件中。

source: Gradle will take care of building the application classes, along with their runtime dependencies, and starting the application with the correct classpath.
zh_cn: Gradle 将会处理好构建的应用程序的类，以及它们的运行时依赖，还有使用正确的类路径启动应用程序。

source: Gradle will take care of compiling and testing the task class and making it available on the classpath of the build script.
zh_cn: Gradle将会编译和测试这个任务类，并且使它在构建脚本的类路径中可用。

source: Gradle's Ivy repository implementations support the equivalent to Ivy's dynamic resolve mode.
zh_cn: Gradle 的Ivy 仓库实现支持相当于 Ivy 的动态解析的模式。

source: Gradle's multi-project features are driven by real life use cases.
zh_cn: Gradle 的多项目特性是由现实生活中的用例所驱动的。

source: Gradle, thanks to Ivy under its hood, is extremely flexible regarding repositories:
zh_cn: Gradle由于 Ivy 在它的 hood 之下，对仓库非常灵活。

source: Groovy Quickstart
zh_cn: Groovy 快速入门

source: Groovy adds lots of useful methods to JVM classes.
zh_cn: Groovy 对 JVM 的类增加了很多有用的方法。

source: Groovy automatically converts a property reference into a call to the appropriate getter or setter method.
zh_cn: Groovy 会自动地把一个属性的引用转换为对适当的 getter 或 setter 方法的调用。

source: Groovy full stacktraces are extremely verbose (Due to the underlying dynamic invocation mechanisms.
zh_cn: Groovy 的全栈跟踪非常冗长 （由于其潜在的动态调用机制，

source: Groovy itself has dependencies.
zh_cn: Groovy 本身具有依赖。

source: Groovy plugin - tasks
zh_cn: Groovy 插件 - tasks

source: Groovy provides plenty of features for creating DSLs, and the Gradle build language takes advantage of these.
zh_cn: Groovy 提供了用于创建 DSL 的大量特点，并且 Gradle 构建语言利用了这些特点。

source: Groovy provides some shortcuts for defining List and Map instances.
zh_cn: Groovy 提供了一些定义List和Map实例的快捷写法。

source: Groovy sources for the given source set.
zh_cn: 给定的source set 的 Groovy 源代码。

source: Groovy web applications
zh_cn: Groovy web程序

source: Handles converting a Maven build to a Gradle build.
zh_cn: 处理转换 Maven 构建为 Gradle 构建。

source: Has directories in the conventional locations for source code
zh_cn: 在源代码中的约定位置有目录

source: Have a look at Conf2ScopeMappingContainer to learn more.
zh_cn: 你可以参考Conf2ScopeMappingContainer来了解更多的信息。

source: Have a look at ExternalModuleDependency to learn all about the API.
zh_cn: 要了解所有该 API 的内容，可以参阅ExternalModuleDependency 。

source: Have a look at ProjectDescriptor for more details.
zh_cn: 更多信息请参阅ProjectDescriptor。

source: Have a look at Settings.
zh_cn: 可以看一下 Settings。

source: Have a look at TaskContainer for more options for locating tasks.
zh_cn: 有关查找任务的更多选项，可以看一下TaskContainer。

source: Have a look at http://groovy.codehaus.org/groovy-jdk/ for more details.
zh_cn: 可以看看http://groovy.codehaus.org/groovy-jdk/，了解更多详细信息。

source: Have a look at TaskContainer for more variations of the create() method.
zh_cn: 关于create ()方法的更多变化可以看看TaskContainer。

source: Have a look at Test for the complete API.
zh_cn: 可以看一看Test的完整的 API。

source: Have also a look at War.
zh_cn: 另请参阅 War。

source: Have also a look at the API documentation of Dependency and Configuration.
zh_cn: 可以看看 Dependency 和 Configuration 的 API 文档。

source: Have also a look at the API documentation: ClientModule
zh_cn: 可以看一看 API 文档： ClientModule

source: Header files that should not be exported (but are used internally) should be placed inside the src/main/c directory (though be aware that such header files should always be referenced in a manner relative to the file including them).
zh_cn: 不应该被导出（而是内部使用）的头文件，应该放在 src/main/c 目录（不过要注意，这样的文件应该总是以相对于包含它们的文件这样一种方式被引用）。

source: Header files that should not be exported (but are used internally) should be placed inside the src/main/cpp directory (though be aware that such header files should always be referenced in a manner relative to the file including them).
zh_cn: 不应该被导出（而是内部使用）的头文件，应该放在 src/main/cpp 目录（不过要注意，这样的文件应该总是以相对于包含它们的文件这样的一种方式被引用）。

source: Hence, starting from version 1.4 new incubating 'configuration on demand' mode is introduced.
zh_cn: 因此，从 1.4 版本起，新引入了一个孵化功能“按需配置”。

source: Hence, when your project depends on a Maven module, it's obvious what its artifact is.
zh_cn: 因此，当你的项目依赖于一个 Maven 模块时，这个模块的 artifact 是哪一个会很明显。

source: Here a link to the Subversion view.
zh_cn: 这里是SVN的视图的链接。

source: Here are some examples of what you can do with a file collection.
zh_cn: 这里是一些使用文件集合的例子。

source: Here are some examples:
zh_cn: 这里有一些例子：

source: Here are some examples: [16]
zh_cn: 这里有一些例子：[16]

source: Here are some situations where this matters:
zh_cn: 以下是一些比较重要的情况：

source: Here are the major highlights of Gradle's support for dependency management:
zh_cn: 这里是 Gradle 支持的依赖管理的主要亮点:

source: Here are the some exemplary reasons why one might want to exclude a transitive dependency.
zh_cn: 下面是为什么可能想要排除传递依赖的一些原因。

source: Here is a brief example which changes the main Java and resource source directories.
zh_cn: 这里是如何更改main Java 和资源源目录的一个简短的例子。

source: Here is a complete example:
zh_cn: 下面是一个完整的例子：

source: Here is a list of some of Gradle's features.
zh_cn: 以下是Gradle的一些特性列表。

source: Here is a sample which generates a combined report for the unit tests from subprojects:
zh_cn: 这里是一个范例，从子项目的单元测试中生成一个联合报告：

source: Here is a simple build script for the project.
zh_cn: 下面是该项目的一个简单的构建脚本。

source: Here is an example how you can configure the upload task of a configuration:
zh_cn: 以下是一个有关配置上传任务的例子：

source: Here is an example where this is different:
zh_cn: 下面是一个展示不同之处的例子：

source: Here is an example which configures the main Java and resources directories:
zh_cn: 下面是一个配置main 的 Java 和资源目录的例子：

source: Here is an example which maintains a copy of the project's runtime dependencies in the build/libs directory.
zh_cn: 这里是一个例子，维护在build/libs目录中的项目运行时依赖的副本。

source: Here is an example with the most important customization options:
zh_cn: 下面是一个示例，展示了最重要的自定义选项：

source: Here is another example:
zh_cn: 这里是另一个示例：

source: Here is how you would export all the dependencies of an Eclipse project:
zh_cn: 下面的例子展示了如何导出一个 Eclipse 项目的所有依赖项：

source: Here is how you would export all the dependencies of an IDEA module:
zh_cn: 下面的例子展示了如何导出一个 IDEA 模块的所有依赖项：

source: Here is our complete build file:
zh_cn: 这里是我们完成的构建文件：

source: Here is what this looks like in code:
zh_cn: 这里是在代码中的表现：

source: Here our task generates several output files from a source XML file.
zh_cn: 在这里我们的任务从一个 XML 源文件生成多个输出文件。

source: Here the output without the -q option:
zh_cn: 这里是不使用-q选项的输出结果︰

source: Here we add a greeting property, and set the value when we declare the greeting task.
zh_cn: 这里我们添加了一个 greeting 属性，并且在我们定义 greeting 任务的时候设置它的值。

source: Here we add tasks to the tasks collection.
zh_cn: 在这里我们将任务添加到tasks集合。

source: Here we replace a task of type Copy with a simple task.
zh_cn: 在这里我们用一个简单的任务替换Copy类型的任务。

source: Here you can see that the TargetedNativeComponent.targetPlatforms() method is used to select the set of platforms to target for executables.main.
zh_cn: 在这里你可以看到 TargetedNativeComponent.targetPlatforms() 方法被用于为 executables.main选择一组平台。

source: Here're all situations in which we fork a new daemon process:
zh_cn: 以下是我们fork一个新的守护进程的所有情况：

source: Here's an example:
zh_cn: 下面是一个示例：

source: Here, uploadTask and archiveTask refer to the tasks used for uploading and generating the archive, respectively (for example uploadArchives and jar).
zh_cn: 在这里， uploadTask和archiveTask分别指向上传和分别生成archive的任务（例如uploadArchives和jar）。

source: Hidden tasks show up in red.
zh_cn: 隐藏的任务显示为红色。

source: Hide the selected tasks.
zh_cn: 隐藏选择的任务。

source: Hierarchical and flat physical layouts get special support.
zh_cn: 分层和产面的物理布局，得到了特别的支持。

source: How does Gradle know whether to do a single or multiproject build?
zh_cn: Gradle 是怎么知道这是单项目还是多项目构建的？

source: How does the parallel execution work?
zh_cn: 并行执行是怎么做的？

source: How to upload your archives is described in Chapter 51, Publishing artifacts.
zh_cn: 关于如何上传archives，将在第51章，发布artifacts中进行描述。

source: However if -Xmx memory setting change or some fundamental immutable system property changes (e.g. file.encoding) then new daemon will be forked.
zh_cn: 然而，如果-Xmx 内存设置更改了，或一些基本的不变的系统属性更改了 （例如 file.encoding），那么将fork新的守护进程。

source: However, be aware that they are not yet considered part of Gradle's public API.
zh_cn: 然而，请注意它们都不被认为是 Gradle 公共 API 的一部分。

source: However, file dependencies are included in transitive project dependencies within the same build.
zh_cn: 然而，文件依赖会被包含在同一个构建的传递项目依赖里。

source: However, in many cases it is not possible to build a particular variant, perhaps because no tool chain is available to build for a particular platform.
zh_cn: 然而，在许多情况下是不可能构建一个特定的变种的，可能的原因是某个特定的平台没有可用的工具链。

source: However, it is not visible outside the build, and so you cannot reuse the task class outside the build it is defined in.
zh_cn: 然而，它在这个构建之外并不可见，因为你不能在定义它的这个构建之外的其他地方来重用这个任务类。

source: However, it will print a warning.
zh_cn: 然而，它将打印一个警告。

source: However, keep in mind that it is usually best to keep configuration in the build script and under source control.
zh_cn: 然而，请记住，通常最好是配置在构建脚本中，并在代码控制下。

source: However, the compileJava task is likely to not be the only task that needs to know where the class files are.
zh_cn: 然而， compileJava任务很可能不是唯 一需要知道类文件在哪里的任务。

source: However, the set of tool chains for a project may also be explicitly defined, allowing additional cross-compilers to be configured as well as allowing the install directories to be specified.
zh_cn: 不过，一个项目里的一组工具链也可以被显示地定义，允许配置额外的交叉编译器以及指定安装目录。

source: However, the task class is not visible outside the build script, and so you cannot reuse the task class outside the build script it is defined in.
zh_cn: 然而，在这个构建脚本脚本之外，这个任务类是不可见的，因此你不能够在你定义这个任务类的脚本之外的地方来利用它。

source: However, this behavior is configurable.
zh_cn: 不过，这种行为是可配置的。

source: However, vast majority of tests and use cases should be handled neatly.
zh_cn: 然而，绝大多数的测试和用例都会被很好地处理。

source: However, where possible Gradle will check if the previously downloaded artifacts are valid before downloading again.
zh_cn: 然而，在再次下载之前Gradle 可能将会检查前一个下载的构件是否有效。

source: However, you can run it then change the working directory via the Setup tab in the UI.
zh_cn: 当然，你也可以先运行它，然后通过在UI中的设置（Setup）选项卡，改变工作目录。

source: IDEA plugin provides hooks and behavior for customizing the generated content.
zh_cn: IDEA 插件提供了一些 hook 和行，用于自定义生成的内容。

source: INFO and higher
zh_cn: INFO 及更高

source: If scanForTestClasses is disabled and no include or exclude patterns are specified, the respective defaults are used.
zh_cn: 如果scanForTestClasses为disabled，并且没有指定 include或exclude模式，则使用各自的默认值。

source: If Gradle finds a module descriptor in a particular repository, it will attempt to download all of the artifacts for that module from the same repository.
zh_cn: 如果 Gradle 在特定仓库中查找模块描述符，它将尝试从同一仓库中下载该模块的所有 artifacts。

source: If Groovy is only used for test code, the Groovy dependency should be added to the testCompile configuration:
zh_cn: 如果 Groovy 仅用于测试代码，Groovy 的依赖应该被添加到testCompile配置中：

source: If Groovy is used for production code, the Groovy dependency should be added to the compile configuration:
zh_cn: 如果 Groovy 用于production 代码，Groovy 依赖应该添加到compile配置中：

source: If Scala is only used for test code, the scala-library dependency should be added to the testCompile configuration:
zh_cn: 如果 Scala 仅用于测试代码， scala-library依赖应被添加到testCompile配置中：

source: If Scala is used for production code, the scala-library dependency should be added to the compile configuration:
zh_cn: 如果 Scala 用于production 代码， scala-library 依赖应该添加到compile的配置中：

source: If a --type parameter is not supplied, Gradle will attempt to infer the type from the environment.
zh_cn: 如果没有提供 --type 参数，Gradle 将尝试从当前环境来推断类型。

source: If a groovy(-indy) Jar is found on classpath, and the project has at least one repository declared, a corresponding groovy(-indy) repository dependency will be added to groovyClasspath.
zh_cn: 如果在classpath中找到groovy(-indy) Jar ，并且该项目已经在至少一个仓库中声明了它，那么相应的groovy(-indy)的仓库依赖将添加到groovyClasspath中。

source: If a groovy-all(-indy) Jar is found on classpath, the same Jar will be added to groovyClasspath.
zh_cn: 如果在在classpath中找到groovy-all(-indy) Jar，相同的 Jar 将添加到groovyClasspath中。

source: If a scala-library Jar is found on classpath, and the project has at least one repository declared, a corresponding scala-compiler repository dependency will be added to scalaClasspath.
zh_cn: 如果在classpath中找到scala-library Jar ，并且该项目已经在至少一个仓库中声明了它，那么相应的scala-compiler的仓库依赖将添加到scalaClasspath中。

source: If a settings.gradle file is found, Gradle checks if the current project is part of the multiproject hierarchy defined in the found settings.gradle file.
zh_cn: 如果找到了settings.gradle文件，Gradle 会检查当前项目是否为找到的settings.gradle文件中定义的多项目层次结构的一部分。

source: If a binary variant cannot be built for any reason, then the NativeBinary associated with that variant will not be buildable.
zh_cn: 如果一个二进制变种因为某些原因不能构建，那么与之关联的NativeBinary将不会是buildable。

source: If a build system does not support such patterns, you either can't solve your problem or you need to do ugly hacks which are hard to maintain and massively afflict your productivity as a build master.
zh_cn: 如果一个构建系统不支持这种模式，你就不能解决你的问题，或者你需要用一些恶心的 hack方法，这样就会很难维护，并且非常影响你的生产力。

source: If a candidate artifact has been downloaded by Maven, Gradle will use this artifact if it can be verified to match the checksum declared by the remote server.
zh_cn: 如果一个候选的构件已经通过 Maven 下载，并且如果它可以和远程服务器定义的校验和匹配，Gradle 将使用这个构件。

source: If a local repository location is defined in a settings.xml, this location will be used.
zh_cn: 如果在settings.xml中定义一个本地仓库的位置，那么这个位置将会被使用。

source: If a module or artifact has not been previously resolved from this repository, Gradle will attempt to resolve the module against the repository.
zh_cn: 如果一个模块或构件以之前没有从这个存储库中解析过，Gradle 将尝试在这个存储库中解析这个模块。

source: If a property in such a file has the prefix systemProp. the property and its value are added to the system properties, without the prefix.
zh_cn: 如果此类文件中的属性有一个systemProp.的前缀，该属性和它的值会被添加到系统属性，且不带此前缀。

source: If a transitive dependency has poor quality metadata that leads to problems at dependency resolution time, you can force Gradle to use a newer, fixed version of this dependency.
zh_cn: 如果传递依赖有质量较差的元数据，导致了依赖解析时的问题时，你可以强制 Gradle 对于这一依赖使用一个较新的，固定的版本。

source: If an upload repository is defined with multiple patterns, Gradle must choose a pattern to use for uploading each file.
zh_cn: 如果一个上传仓库中定义了多个模式，Gradle 必须为每个文件选择上传模式。

source: If any of the following criteria match, the class is considered to be a JUnit test class:
zh_cn: 如果满足以下的任何一个条件，这个类就被认为是一个 JUnit 测试类：

source: If any of these properties is empty the trailing - is not added to the name.
zh_cn: 如果这些属性中的任何一个为空，那后面的-不会被添加到该名称中。

source: If anyone knows a better overview, please let us know via the mailing list.
zh_cn: 如果有人知道更好的概述，请发邮件让我们知道。

source: If dependencies have file names with version numbers it is much easier to quickly identify the versions of your dependencies.
zh_cn: 如果依赖的文件名称带有版本号，那么将更容易快速确定依赖的版本。

source: If it is too verbose, real warnings and problems are easily hidden by this.
zh_cn: 如果日志太多，真正的警告和问题容易被隐藏。

source: If no settings.gradle file is found, the build is executed as a single project build.
zh_cn: 如果仍没有找到settings.gradle文件，将作为一个单项目构建来执行。

source: If no settings.gradle is found, it searches the parent directories for the existence of a settings.gradle file.
zh_cn: 如果没有找到settings.gradle，它将在父目录里搜索settings.gradle文件。

source: If no url parameter is supplied, then Gradle will use the first defined artifactPattern for uploading, or the first defined ivyPattern for uploading Ivy files, if this is set.
zh_cn: 如果没有提供url参数，Gradle 将使用第一个定义的artifactPattern来上传，或者对于上传Ivy文件而言，将使用第一个定义的ivyPattern，如果这个参数有设置。

source: If no settings.xml is available, Gradle uses the default location USER_HOME/.m2/repository.
zh_cn: 如果没有settings.xml可用，Gradle 将使用默认的位置USER_HOME/.m2/repository。

source: If no build types are defined in a project, then a single, default build type called 'debug' is added.
zh_cn: 如果在project中没有定义任何构建类型，那么会有一个默认的“debug”构建类型被加进去。

source: If no flavor is defined for a component, then a single default flavor named 'default' is used.
zh_cn: 如果一个组件没有定义任何的flavor，那么会使用一个默认的“default”的flavor。

source: If no module descriptor is found, Gradle will search for the presence of the primary module artifact file indicating that the module exists in the repository.
zh_cn: 如果没有找到模块描述符，Gradle 将搜索表示模块存在于存储库中的主要模块 artifact文件。

source: If no platforms are defined in a project, then a single, default platform 'current' is added.
zh_cn: 如果在project里没有定义任何平台，那么会添加一个默认的“current”平台。

source: If no snapshot repository is defined, releases and snapshots are both deployed to the repository element.
zh_cn: 如果没有定义任何snapshot 仓库，release和snapshot都将部署到repository元素中。

source: If no such module descriptor file exists, Gradle looks for a file called hibernate-3.0.5.jar to retrieve.
zh_cn: 如果不存在这样的模块描述符文件，Gradle 会查找一个hibernate-3.0.5.jar 文件。

source: If no target platforms are defined for a project, then all binaries are built to target a default platform named 'current'.
zh_cn: 如果在project里没有定义任何平台，那么所有的二进制文件会针对一个默认平台“current”进行构建。

source: If no tests with this pattern can be found an exception is thrown.
zh_cn: 如果这个模式无法找到任何测试，那么将会抛出一个异常。

source: If not specified in the (Ivy) descriptor, the status defaults to integration for Ivy modules and Maven snapshot modules, and release for Maven modules that aren't snapshots.
zh_cn: 如果没有在（Ivy）描述符中指定，Ivy 模块和 Maven snapshot模块的状态默认为integration ，不是snapshot 的 Maven 模块则默认为release。

source: If not, the build is executed as a single project build.
zh_cn: 如果不是，构建将作为一个单项目构建来执行。

source: If nothing else is defined, Gradle executes the task in alphanumeric order.
zh_cn: 如果没有别的定义，Gradle 会按字母数字顺序执行该任务。

source: If project A has a compile dependency on project B then building A causes configuration of both projects: A and B.
zh_cn: 如果项目 A 对项目 B 有编译依赖，那么构建A的时候也会导致 A和B两个项目的配置。

source: If required modules are not present in the dependency cache, build execution will fail.
zh_cn: 如果所需的模块在依赖缓存中不存在，构建执行将会失败。

source: If someone asks you to look at a collection of 20 jar files, which would you prefer?
zh_cn: 如果有人让你看 20 个 jar 文件，你更喜欢哪一种？

source: If someone wants to use your project as a library, she simply needs to declare on which configuration of the dependency to depend on.
zh_cn: 如果其他人想要把你的项目作为一个库使用，她只需要在依赖配置上声明，使她的项目依赖你的库。

source: If specifying this information in the user gradle.properties file is not feasible for your environment, you can source the information however you need to and set the project properties manually.
zh_cn: 如果在用户的gradle.properties文件中指定的信息不适合你的环境，你可以提供这些信息，但你需要手动设置项目的属性。

source: If such a module descriptor file exists, it is parsed and the artifacts of this module (e.g. hibernate-3.0.5.jar) as well as its dependencies (e.g. cglib) are downloaded.
zh_cn: 如果存在此类模块描述符文件，它会进行分析，并下载此模块的 artifacts （例如hibernate-3.0.5.jar）以及其依赖项（例如 cglib）。

source: If tests of more than one subproject are executed, the pattern is applied to each subproject.
zh_cn: 如果执行了一个以上的子项目的测试，该模式会被应用于每一个子项目中。

source: If the DEBUG log level is chosen, truncated stacktraces are always printed.
zh_cn: 如果选择 DEBUG 日志级别，则总是输出截断后的栈跟踪信息。

source: If the revConstraint attribute is not present, the rev attribute is used instead.
zh_cn: 如果不存在revConstraint属性，则使用rev属性。

source: If the JAR can't be found there, the artifact URLs are used to look for JARs.
zh_cn: 如果那里找不到 JAR，就会用 artifact URLs 来查找 JAR 文件。

source: If the Java plugin is also applied to your project, a new task named jacocoTestReport is created that depends on the test task.
zh_cn: 如果 Java 插件也被应用于你的项目，那么会创建一个名为jacocoTestReport的新任务，该新任务依赖于test任务。

source: If the Java plugins is applied, the OSGi plugin replaces the manifest object of the default jar with an OsgiManifest object.
zh_cn: 如果应用了 Java 插件，OSGi 插件将把默认 jar 的 manifest 对象替换为一个OsgiManifest对象。

source: If the argument is a task, the output files (i.e. the files the task creates) of the task are copied and the task is automatically added as a dependency of the Copy task.
zh_cn: 如果参数是一个任务，那么任务的输出文件 （即该任务创建的文件）会被复制，并且该任务会自动添加为Copy任务的依赖项。

source: If the based manifest and the merged manifest both define values for the same key, the merged manifest wins by default.
zh_cn: 如果基本的manifest和要合并的manifest都定义了同一个key的值，那么默认情况下会采用要合并的manifest的值。

source: If the checksum can be retrieved, an artifact is not downloaded if an artifact already exists with the same id and checksum.
zh_cn: 如果校验和可以获取到，并且如果已经存在具有相同 id 和校验和的构件，则不会再去下载这个构件。

source: If the checksum cannot be retrieved from the remote server, the artifact will be downloaded (and ignored if it matches an existing artifact).
zh_cn: 如果校验和不能从远程服务器检索，构件将被下载（并且忽略它所匹配的现有的构件）。

source: If the classpath contains jars with an OSGi bundle, the bundle information is used to specify version information for the Import-Package value.
zh_cn: 如果 classpath 中包含了 jar 包和 OSGi bundle，bundle 信息会被用来指定 Import-Package的值的版本信息。

source: If the current project contains a settings.gradle file, the -u option has no meaning.
zh_cn: 如果当前项目中包含一个settings.gradle文件， -u选项将没有任何意义。

source: If the daemon process is currently busy running some job, a brand new daemon process will be started.
zh_cn: 如果该守护进程当前正忙于运行一些作业，将启动一个全新的守护进程。

source: If the default location for the local repository is redefined in a Maven settings.xml, this is considered by this task.
zh_cn: 本地仓库的默认位置是否在 Maven settings.xml中被重新定义，这项任务也会考虑到。

source: If the dependency is declared as a dynamic version (like 1.+), Gradle will resolve this to the newest available static version (like 1.2) in the repository.
zh_cn: 如果依赖被声明为一个动态版本（像1.+），Gradle 将会把它解析到在仓库中的最新的可用的静态版本（如1.2）。

source: If the module descriptor is a POM file that has a parent POM declared, Gradle will recursively attempt to resolve each of the parent modules for the POM.
zh_cn: 如果模块描述符是一个具有的父 POM 文件声明的 POM 文件，Gradle 将以递归方式尝试为该 POM 文件解析每个父模块。

source: If the new snapshots are the same as the previous snapshots, Gradle assumes that the outputs are up to date and skips the task.
zh_cn: 如果新的快照和前一次的快照一样，Gradle 会假定这些输出是最新状态的并跳过该任务。

source: If the plugin has previously been applied, any further applications will have no effect.
zh_cn: 如果以前已应用了该插件，任何进一步的应用都不会再有任何效果。

source: If the rules for skipping a task can't be expressed with predicate, you can use the StopExecutionException.
zh_cn: 如果跳过任务的规则不能与断言同时表达，您可以使用StopExecutionException。

source: If the task completes successfully, Gradle takes a snapshot of the outputs.
zh_cn: 如果任务成功完成，Gradle 将对输出进行一次快照。

source: If the type could not be inferred, the type "basic" will be used.
zh_cn: 如果无法推断类型，将使用“basic”类型。

source: If these task names exist, they are executed as a separate build in the order you have passed them.
zh_cn: 如果这些任务名称存在，它们以参数的顺序作为一个单独的构建来执行。

source: If they are not the same, Gradle executes the task.
zh_cn: 如果它们不一则， Gradle 则会执行该任务。

source: If this exception is thrown by an action, the further execution of this action as well as the execution of any following action of this task is skipped.
zh_cn: 如果一个操作（action）抛出了此异常，那么这个操作（action）接下来的行为和这个任务的其他 操作（action）都会被跳过。

source: If this file already exists in the appDirName/META-INF then the existing file contents will be used and the explicit configuration in the ear.deploymentDescriptor will be ignored.
zh_cn: 如果此文件已存在于appDirName/META-INF，那么会使用这个已存在的文件的内容，而 ear.deploymentDescriptor中的显式配置将被忽略。
